import React, { useEffect, useState } from "react";
import { Document, Page, Text, StyleSheet, Font } from "@react-pdf/renderer";
import { Button } from "react-bootstrap";
import { respons } from "../../servises";

const Pdf = (props) => {
  const [project, setProject] = useState(null);
  const [load, setLoad] = useState(true);

  useEffect(() => {
    respons(
      "get",
      "/projectDeteils?" + new URLSearchParams({ id: props.match.params.id })
    ).then((data) => {
      setProject(data);
      setLoad(false);
    });
  }, []);

  Font.register({
    family: "Roboto",
    fonts: [
      {
        src: "../../../public/fonts/Roboto/Roboto-Regular.ttf",
        fontStyle: "normal",
        fontWeight: "normal",
      },
    ],
  });

  const styles = StyleSheet.create({
    page: {
      fontFamily: "Roboto",
      fontSize: "12px",
      paddingLeft: "75px",
      paddingRight: "56px",
      paddingTop: "56px",
      paddingBottom: "56px",
    },
  });
  const { translate } = props;
  return (
    <Document>
      {!load && (
        <Page size="A4" style={styles.page}>
          <Text
            style={{
              textAlign: "center",
              fontFamily: "Roboto",
            }}
          >{`Договір підряду на капітальне будівництво`}</Text>
          <Text>
            {`
"${new Date().getDate()}" ${new Date().getMonth()} ${new Date().getFullYear()} року`}
          </Text>
          <Text>
            {`Клієнт ${project.fullNameCustomer}, що іменується надалі "Замовник", який діє на підставі Статуту, з одного боку, та ${project.fullNameContactor}, що іменується надалі "Підрядчик", який діє на підставі Статуту, з другого боку, які спільно за текстом цього Договору іменуються "Сторони", а кожний окремо "Сторона", уклали цей Договір про наступне:`}
          </Text>
          <Text
            style={{
              textAlign: "center",
              fontFamily: "Roboto",
            }}
          >
            {`
1. ПРЕДМЕТ ДОГОВОРУ`}
          </Text>
          <Text>
            {`
1.1. Підрядник зобов'язується виконати роботи з будівництва за адресою: ${project.FullBuldingAdress} (далі - Об'єкт) згідно із затвердженою проектною-кошторисною документацією (далі - Роботи Підрядника) та здати в експлуатацію Об'єкт у встановлений клієнтом термін.`}
          </Text>
          <Text>
            {`1.2. Замовник зобов'язується надати Підряднику будівельний майданчик, проектно-кошторисну документацію, забезпечити своєчасне фінансування будівництва, прийняти завершений будівництвом об'єкт і повністю сплатити вартість виконаних робіт у порядку і в розмірах, передбачених цим Договором та додатками до нього. `}
          </Text>
          <Text
            style={{
              textAlign: "center",
              fontFamily: "Roboto",
            }}
          >{`
2. ТЕРМІН ВИКОНАННЯ РОБІТ`}</Text>
          <Text>
            {`
2.1. Загальний термін виконання Робіт Підрядником за цим Договором передбачено Графіком провадження робіт які встановлюються Замовником і терміном введення Об'єкта в експлуатацію. 
2.2. Підрядник має право залучити до виконання роботи інших осіб (субпідрядників), залишаючись відповідальним перед замовником за результат їхньої роботи. У цьому випадку підрядник виступатиме перед замовником як генеральний підрядник, а перед субпідрядником як замовник.
2.3. Відповідальність за дотримання субпідрядними організаціями термінів та якості виконаних субпідрядними організаціями робіт несе Підрядник.
2.4. Дата введення Об'єкта експлуатацію є датою закінчення виконання Робіт Підрядником.`}
          </Text>
          <Text
            style={{
              textAlign: "center",
              fontFamily: "Roboto",
            }}
          >{`
3. ПРАВА Й ОБОВ'ЯЗКИ СТОРІН`}</Text>
          <Text>
            {`
3.1.1. Розпочати будівництво Об’єкту не пізніше з 10 днів календарних днів з моменту надання Замовником будівельного майданчика та проектно-кошторисної документації. 
3.1.2. Виконати власними силами і за власні кошти, зі свого матеріалу, якісно та у встановлений цим Договором термін та передбачені цим Договором Роботи Підрядника відповідно до затвердженої проектно-кошторисної документації та здати Об’єкт в експлуатацію у встановлений пунктом 2.1. цього Договору термін. 
3.1.3. Надати Замовнику документи, що підтверджують якість матеріалів та обладнання, що використовуються Підрядником для виконання робіт, передбачених цим Договором. Підрядник надає гарантію відповідності якості матеріалів та обладнання, що використовуються ним для виконання робіт, матеріалам та обладнанню, що затверджені проектною документацією. 
3.1.4. При виконанні Робіт дотримуватися на будівельному майданчику всіх необхідних заходів протипожежної безпеки, техніки безпеки з охорони праці та охорони довкілля протягом всього терміну проведення Робіт до моменту здачі Об'єкта в експлуатацію Замовнику, відповідно до норм та правил згідно чинного в Україні законодавства. 
3.1.5. Виконати Роботи Підрядника за цим Договором з дотриманням будівельних норм та правил, що діють в Україні. Оформити відповідно до чинних норм України виконавчу документацію, акти прихованих робіт, протоколи випробувань та інші документи компетенції Підрядника, необхідні для здачі Об'єкта в експлуатацію за цим Договором. 
3.1.6. Забезпечити збереження матеріалів та обладнання, а також результат виконаних Робіт до моменту здачі Об'єкта в експлуатацію. 
3.1.7. До 7 числа кожного місяця надавати Замовникові акти виконаних робіт. 
3.1.8. До моменту здачі Об'єкта в експлуатацію передати Замовнику всю виконавчу документацію, необхідну технічну документацію, паспорти та сертифікати на використовувані матеріали й обладнання. 
3.2. Підрядник у рамках цього Договору має право: 
3.1.1. Одержувати оплату за виконані обсяги робіт у розмірах та в строки, передбачені цим Договором. 
3.1.2. За власним вибором та за попередньою письмовою згодою замовника залучати до виконання визначених обсягів робіт субпідрядні спеціалізовані будівельні та інші організації. 
3.3. Замовник у рамках цього Договору зобов'язується: 
3.1.1. Передати Підряднику будівельний майданчик не пізніше 30 календарних днів з моменту підписання цього Договору. 
3.1.2. До початку виконання робіт забезпечити Підрядника затвердженою проектно-кошторисною документацією та всіма необхідними документами, що дозволяють виконання Робіт Підрядника. 
3.1.3. До початку виконання робіт зробити передоплату в розмірі 30 % від загальної вартості робіт на розрахунковий рахунок Підрядника. 
3.1.4. Прийняти результати Робіт Підрядника за цим Договором у порядку, передбаченому чинним законодавством України. 
3.1.5. Сплатити вартість виконаних Підрядником Робіт за цим Договором у порядку та в обсягах, передбачених Розділом 4 цього Договору. 
3.4. Замовник має право: 
3.1.1. У будь-який час здійснювати контроль та нагляд за ходом і якістю Робіт, що виконуються Підрядником, дотриманням Підрядником термінів та строків їх виконання, якістю матеріалів та обладнання, що надаються Підрядником, не втручаючись при цьому в оперативно-господарську діяльність Підрядника. 
3.1.2. За своїм вибором вимагати безоплатного виправлення недоліків у виконаних Роботах або відшкодування понесених ним необхідних витрат з виправлення своїми коштами недоліків Робіт або відповідного зменшення винагороди за Роботи, якщо Підрядник припустився відхилень від умов цього Договору, наслідком чого стало результатів Робіт, або допустив інші недоліки при виконанні Робіт.`}
          </Text>
          <Text
            style={{
              textAlign: "center",
              fontFamily: "Roboto",
            }}
          >{`
4. СУМА ДОГОВОРУ ТА ПОРЯДОК РОЗРАХУНКІВ`}</Text>
          <Text>
            {`
4.1. Загальна сума цього Договору складається з витрат Підрядника та вартості Робіт, що виконуються Підрядником за цим Договором. Загальна попередня сума цього Договору - ${project.CommonApproximateConstructionEstimate} грн. 
4.2. Остаточна сума цього Договору буде додатково узгоджена Сторонами в Додатку до цього Договору на основі узгодженого Сторонами кошторису з урахуванням зауважень та змін у процесі будівництва. 
4.3. Вартість робіт за цим договором визначається у Додатку 2 до цього Договору. 
4.4. Зміна вартості робіт або матеріалів, вказаних у Кошторисному розрахунку, можлива тільки у разі внесення Замовником змін до робочого проекту або Дизайн-проекту або у разі подорожчання матеріалів, виробів і конструкцій, що підтверджується документально та оформляється додатковою угодою до цього Договору. 
4.5. Оплата за цим Договором здійснюється Замовником Підряднику відповідно до  Графіку платежів платіжними дорученнями на розрахунковий рахунок Підрядника в національній валюті України з урахуванням фактично виконаних обсягів робіт Підрядником на підставі актів виконаних робіт. 
4.6. Остаточний розрахунок з Підрядником здійснюється протягом 30 робочих днів після здачі Об'єкта в експлуатацію та підписання акта державної комісії про здачу Об'єкта в експлуатацію. 
4.7. При недотриманні Підрядником Графіку виконання робіт Замовник має право відповідно зменшити суму платежу на величину невиконаних робіт, при цьому терміни провадження і закінчення Робіт Підрядника не змінюються. 
4.8. Уразі припинення Робіт за цим Договором з ініціативи Підрядника, він зобов'язаний протягом 3-х банківських днів з дня отримання письмової вимоги Замовника повернути суму авансових платежів, зроблених Замовником, за вирахуванням вартості проведених робіт і встановлених на об'єкті конструкцій. Підрядник також відшкодовує Замовникові всі збитки, пов'язані з припиненням Договору і сплачує штраф у розмірі 10 % від загальної вартості Робіт Підрядника, за актом зупинення або припинення Робіт. 
4.9. У разі необхідності проведення робіт, не врахованих при складанні Додатків до цього Договору, перелік таких робіт, їх вартість, графік виконання робіт та графік платежів будуть зафіксовані сторонами у Додаткових угодах до Договору, які є невід'ємною частиною Договору. 
4.10. За дострокове виконання робіт більше ніж на 10 днів Замовник здійснює Підрядчику доплату в розмірі 5% від вартості робіт.`}
          </Text>
          <Text
            style={{
              textAlign: "center",
              fontFamily: "Roboto",
            }}
          >{`
5. ПОРЯДОК ЗДАВАННЯ ТА ПРИЙМАННЯ РОБІТ`}</Text>
          <Text>
            {`
5.1. Здавання-приймання виконаних робіт оформляється актами приймання-передачі, підписаними обома сторонами, які щомісяця подаються Підрядником Замовнику. 
5.2. Здавання-приймання в експлуатацію об'єкта загалом оформляється актом, дата підписання якого Сторонами визначає момент передачі об'єкта у власність Замовника. 
5.3. Замовник зобов'язаний прийняти роботи, виконані Підрядником, не пізніше 30 календарних днів з дня отримання від Підрядника акта виконаних робіт. 
5.4. У випадку мотивованої відмови Замовника прийняти виконані роботи Сторонами складається акт з переліком претензій Замовника, в якому вказуються терміни усунення недоліків у виконаних роботах. 
          `}
          </Text>
          <Text
            style={{
              textAlign: "center",
              fontFamily: "Roboto",
            }}
          >{`
6. ГАРАНТІЙНІ ТЕРМІНИ`}</Text>
          <Text>
            {`
6.1. Гарантія виконаних Робіт Підрядника встановлюється здати введення Об'єкта в експлуатацію і становить 5 років. 
6.2. Підрядник зобов'язаний за свій рахунок та своїми силами усувати недоліки (дефекти), несправності, виявлені протягом гарантійного терміну, вказаного у п. 6.1 цього Договору. 
6.3. Перелік недоліків визначається дефектним актом, складеним Сторонами. У акті фіксуються дата виявлення недоліків і терміни їх усунення. 
6.4. У разі усунення недоліків (дефектів) у Роботах Підрядника в період гарантійного терміну, які зупиняють роботу Замовника на період їх усунення, гарантійний термін обчислюється заново з дня усунення недоліків.`}
          </Text>
          <Text
            style={{
              textAlign: "center",
              fontFamily: "Roboto",
            }}
          >{`
7. СТРАХУВАННЯ РИЗИКІВ`}</Text>
          <Text>
            {`
7.1. Підрядник зобов'язаний протягом 30 календарних днів з дня укладення цього Договору за свій рахунок застрахувати такі ризики: 
- що виникають при транспортуванні матеріалів, пристроїв, конструкцій та виробів від місця їх вивантаження до будівельного майданчика; 
- що пов'язані зі збереженням виконаних робіт, матеріальних цінностей, розмішених на будівельному майданчику, від вогню та стихійного лиха у період від початку робіт на об'єкті до моменту здачі його в гарантійну експлуатацію; 
- що виникають відповідно до законів про охорону праці. 
7.2. Підрядник зобов'язаний передати Замовникові копії страхових полісів та підтвердження сплати страхових платежів протягом 10 днів з моменту підписання цього Договору.`}
          </Text>
          <Text
            style={{
              textAlign: "center",
              fontFamily: "Roboto",
            }}
          >{`
8. ВІДПОВІДАЛЬНІСТЬ СТОРІН`}</Text>
          <Text>
            {`
8.1. За невиконання або неналежне виконання узятих на себе зобов'язань за цим Договором Сторони несуть відповідальність у порядку та на умовах, зазначених у цьому Договорі, а саме: 
8.1.1. Відповідальність Підрядника: 
- за порушення терміну введення Об'єкта в експлуатацію, вказаного у п. 2.1. Договору, Підрядник сплачує Замовникові штраф у сумі 5000 грн. за кожен день прострочення; 
- за неякісне виконання Робіт Підрядника, передбачених цим Договором, Підрядник зобов'язаний виправити їх за свій рахунок або відшкодувати Замовнику вартість виправлення неякісне виконаних робіт у повному обсязі; 
- сплата штрафу не звільняє Підрядника від обов'язку належного виконання зобов'язань за цим Договором; 
- уразі порушення Підрядником терміну введення в експлуатацію Об'єкта, вказаного у п. 2.1 цього Договору, більш ніж на 30 календарних днів Замовник має право на розірвання Договору, компенсацію збитків і стягнення штрафних санкцій, передбачених Договором та чинним законодавством, що виникли у зв'язку з порушенням термінів введення Об'єкта в експлуатацію. 
8.1.2. Відповідальність Замовника: 
- за невчасне здійснення розрахунків Замовник сплачує Підряднику пеню в розмірі подвійної облікової ставки НБУ від суми нездійсненого платежу на користь Підрядника за кожен день прострочення.`}
          </Text>
          <Text
            style={{
              textAlign: "center",
              fontFamily: "Roboto",
            }}
          >{`
9. ФОРС-МАЖОР`}</Text>
          <Text>
            {`
9.1. Сторони звільняються від відповідальності за часткове або повне невиконання зобов'язань за цим Договором, якщо це невиконання стало слідством обставин непереборної сили, що виникли після укладення Договору внаслідок подій надзвичайного характеру, які Сторона не могла ні передбачити, ні запобігти їм розумними заходами (форс-мажор).
9.2. При настанні і (або) припиненні вказаних у п. 9.1. цього Договору обставин Сторона, яка довідалася або повинна була довідатися про цей факт, повідомляє іншу Сторону протягом 5 діб, додавши відповідне підтвердження (свідоцтво, видане торговельно-промисловою палатою, є достатнім підтвердженням наявності і тривалості дії непереборної сили). 
9.3. За відсутності своєчасного повідомлення винна Сторона зобов'язана відшкодувати іншій Стороні збитки, заподіяні іншій Стороні неповідомленням або невчасним повідомленням про настання обставин непереборної сили. 
9.4. Настання форс-мажорних обставин збільшує термін виконання Договору на період їх дії.`}
          </Text>
          <Text
            style={{
              textAlign: "center",
              fontFamily: "Roboto",
            }}
          >{`
10. ПОРЯДОК РОЗГЛЯДУ СПОРІВ ТА ЗАСТОСОВУВАНЕ ПРАВО`}</Text>
          <Text>
            {`
10.1. При виникненні між Сторонами спорів та розбіжностей за цим Договором або у зв'язку з ним Сторони зроблять усе необхідне для врегулювання спорів та розбіжностей шляхом переговорів. 
10.2. Спори та розбіжності у рамках цього Договору, врегулювання яких Сторони не можуть досягти шляхом переговорів, передаються на розгляд господарського суду. 
10.3. При розгляді спорів між Сторонами застосовується матеріальне і процесуальне право України.`}
          </Text>
          <Text
            style={{
              textAlign: "center",
              fontFamily: "Roboto",
            }}
          >{`
11. ІНШІ УМОВИ`}</Text>
          <Text>
            {`
11.1. Сторони зобов'язані у триденний термін з дня підписання цього Договору обмінятися листами із зазначенням офіційних представників Сторін та їхніх повноважень з виконання цього Договору. 
11.2. Цей Договір може бути змінений або доповнений за взаємною згодою Сторін. 
11.3. Усі зміни та доповнення до цього Договору повинні бути зроблені у письмовій формі та підписані Сторонами. Такі зміни і доповнення додаються до цього Договору і є його невід'ємною частиною. 
11.4. Замовник є платником податку на прибуток на загальних підставах. 
11.5. Підрядник є платником податку на прибуток на загальних підставах. 
11.6. Цей Договір набирає чинності з моменту його підписання і діє до моменту виконання Сторонами своїх зобов'язань за цим Договором. 
11.7. Цей Договір складено у двох примірниках, по одному для кожної зі Сторін, що мають однакову юридичну силу.`}
          </Text>
          <Text
            style={{
              textAlign: "center",
              fontFamily: "Roboto",
            }}
          >{`
12. ЮРИДИЧНІ АДРЕСИ, РЕКВІЗИТИ І ПІДПИСИ СТОРІН`}</Text>
          <Text>
            {`
ЗАМОВНИК ${project.fullNameCustomer} 

ПІДРЯДНИК ${project.fullNameContactor}`}
          </Text>
        </Page>
      )}
    </Document>
  );
};

export default Pdf;
